In [72]:
import pandas as pd 
import matplotlib as plt
import ipywidgets as widgets
from ipywidgets import *

In [73]:
#OPENING DATA FILE

In [74]:
df = pd.read_csv('hari batteries.csv')
df.head()

,S.no,Description of product,Quantity,date,Price,CSGST,SGST,Amount,Month
0,1,Amaron flo 40b 20l,1,19-May-20,2929.68,410.15,410.15,3750.00,may
1,2,Amaze battrey 2048tt,1,19-May-20,8281.25,1159.37,1159.37,10599.99,may
2,3,microtek invertor eb-7wva,1,19-May-20,2118.64,190.67,190.67,2499.98,may
3,4,microtek invertor eb-7wva,1,19-May-20,2288.13,205.73,205.73,2699.59,may
4,5,Amaron flo 40b 20l,1,22-May-20,2500.00,350.00,350.00,3200.00,may

In [75]:
#popping the usefull columns of the original dataframe to make a new dataframe

In [76]:
df1 = df.pop('Description of product')
df2 = df.pop('Month')
df3=df.pop('Amount')

In [77]:
df4 = pd.concat([df1,df2], axis=1)
new_df = pd.concat([df4,df3], axis=1)
new_df.head()

      Description of product Month    Amount
0         Amaron flo 40b 20l   may   3750.00
1       Amaze battrey 2048tt   may  10599.99
2  microtek invertor eb-7wva   may   2499.98
3  microtek invertor eb-7wva   may   2699.59
4         Amaron flo 40b 20l   may   3200.00

In [78]:
group = new_df.groupby(['Description of product','Month']).sum()
group.head()

                               Amount
Description of product Month
Amaron flo 40b 20l     aug    7499.96
                       jun    3699.98
                       may    6950.00
                       nov    4000.00
                       oct    7399.96

In [79]:
reset = group.reset_index()
reset.head()

  Description of product Month   Amount
0     Amaron flo 40b 20l   aug  7499.96
1     Amaron flo 40b 20l   jun  3699.98
2     Amaron flo 40b 20l   may  6950.00
3     Amaron flo 40b 20l   nov  4000.00
4     Amaron flo 40b 20l   oct  7399.96

In [80]:
# plotting an interactive bar chart of the new dataframe

In [81]:
@interact

def bar_plot( Products = sorted(reset['Description of product'].unique())):
    return reset[reset['Description of product'] == Products].set_index('Month').plot(kind ='bar', title=Products, fontsize =10, color='red')

interactive(children=(Dropdown(description='Products', options=('Amaron flo 40b 20l', 'Amaze battrey 2048tt', â€¦